In [1]:
import pandas as pd
df=pd.read_csv('Testdata.csv')
df

  job_title  age
0   Manager   45
1  Engineer   30
2   Manager   35
3  Engineer   28
4   Manager   50

In [67]:
#1.Write a script to calculate the average age of employees grouped by their job titles.
# select job_title,avg(age) from testdata group by job_title;
df.groupby('job_title')['age'].mean().reset_index(name='average_age')

  job_title  average_age
0  Engineer    29.000000
1   Manager    43.333333

In [69]:
#2.Write a script to count the number of employees in each department.
#select deptno,count(*) from Emp_Dept grouy by deptno;
df=pd.read_csv('Emp_Dept.csv')
df
df.groupby('deptno')['ename'].count().reset_index(name='Number_Of_employees')

   deptno  Number_Of_employees
0       1                    2
1       2                    2
2       3                    1

In [76]:
#3.Write a script to sort employees by their joining date in descending order.
#select * from Emp_Join order by joining_date desc;
df=pd.read_csv('Emp_Join.csv',parse_dates=['joining_date'])
#parse_dates=['joining_date']--converts joining_date into datetime objects
df
df.sort_values(by='joining_date', ascending=False)

     ename joining_date
2  Charlie   2021-03-30
4      Eve   2020-11-10
0    Alice   2020-01-15
1      Bob   2019-05-20
3    David   2018-08-12

In [81]:
#4.Write a script to find the maximum salary in each department.
#select deptno,max(salary) from Dept_Sal group by deptno;
df=pd.read_csv('Dept_Sal.csv')
df
max_salary=df.groupby('deptno').max('salary').reset_index()
max_salary.columns=['deptno','max_salary']
print(max_salary)

   deptno  max_salary
0       1       60000
1       2       70000

In [83]:
#5.Write a script to group employees by their city and find the total number of employees in each city.
#select city,count(*) from City_Emp group by city
df=pd.read_csv('City_Ename.csv')
df
total_employees=df.groupby('city').count().reset_index()
total_employees.columns=['city','Total_No_Employees']
print(total_employees)

          city  Total_No_Employees
0      Chicago                   1
1  Los Angeles                   2
2     New York                   2

In [88]:
#6.Write a script to find the minimum and maximum age of employees grouped by their gender.
#select gender,min(age),max(age) from Gen_Age group by gender;
df=pd.read_csv('Gen_Age.csv')
df
df.groupby('gender')['age'].agg(['min','max'])

        min  max
gender
F        25   28
M        30   40

In [91]:
grouped=df.groupby('gender')['age'].agg(['min','max']).reset_index()
grouped.columns=['gender','min_age','max_age']
print(grouped)

  gender  min_age  max_age
0      F       25       28
1      M       30       40

In [93]:
#7.Write a script to calculate the total sales per product category.
#select category,sum(sales) from cat_sales group by category;
df=pd.read_csv('Cat_Sales.csv')
df
total_sales=df.groupby('category')['sales'].sum().reset_index()
total_sales.columns=['category','total_sum']
#total_sales
print(total_sales)

      category  total_sum
0     Clothing       1300
1  Electronics       2500
2    Groceries        700

In [96]:
#8.Write a script to calculate the average salary per department and store the results in a new DataFrame.
#select deptno,avg(salary) from Dept_Sal_Ename group by deptno
df=pd.read_csv('Dept_Sal_Ename.csv')
df
Average_Salary=df.groupby('deptno').mean('Salary')
Average_Salary.rename(columns={'salary':'average_salary'},inplace=True)
print(Average_Salary)

        average_salary
deptno
1         56666.666667
2         62500.000000
3         46500.000000

In [97]:
df=pd.read_csv('Dept_Sal_Ename.csv')
df
Average_Salary=df.groupby('deptno',as_index=False).mean('Salary')
Average_Salary.rename(columns={'salary':'average_salary'},inplace=True)
print(Average_Salary)

   deptno  average_salary
0       1    56666.666667
1       2    62500.000000
2       3    46500.000000

In [ ]:
#By default, when you use groupby in Pandas without specifying as_index=False, the grouped column(s) become the index of the resulting DataFrame
#and the output is series.
#But when we use as_index=True,we get the index as shown above like: 0 1 2 and output is dataframe.